In [1]:
import pandas as pd
import pandas as pd
import numpy as np


pd.set_option('display.max_columns', None)

import warnings
warnings.simplefilter('ignore')

In [2]:
df=pd.read_csv('scrubbed.csv')

In [3]:
new_cols=[c.strip() for c in df.columns]
df=df.rename(columns={k:v for k,v in zip(df.columns, new_cols)})

In [4]:
df.country.value_counts()

us    65114
ca     3000
gb     1905
au      538
de      105
Name: country, dtype: int64

In [5]:
df.duplicated().sum()

0

In [6]:
df2 = df.dropna(axis=0,how='all')

In [7]:
df2.shape

(80332, 11)

In [8]:
df2= df2.dropna(thresh = 3)

In [9]:
df2.shape

(80332, 11)

In [10]:
df2['shape'].value_counts()

light        16565
triangle      7865
circle        7608
fireball      6208
other         5649
unknown       5584
sphere        5387
disk          5213
oval          3733
formation     2457
cigar         2057
changing      1962
flash         1328
rectangle     1297
cylinder      1283
diamond       1178
chevron        952
egg            759
teardrop       750
cone           316
cross          233
delta            7
round            2
crescent         2
hexagon          1
changed          1
flare            1
dome             1
pyramid          1
Name: shape, dtype: int64

In [11]:
df2.state=df2.state.dropna()

In [12]:
df2.head()

,datetime,city,state,country,shape,duration (seconds),duration (hours/min),comments,date posted,latitude,longitude
0,10/10/1949 20:30,san marcos,tx,us,cylinder,2700,45 minutes,This event took place in early fall around 194...,4/27/2004,29.8830556,-97.941111
1,10/10/1949 21:00,lackland afb,tx,NaN,light,7200,1-2 hrs,1949 Lackland AFB&#44 TX. Lights racing acros...,12/16/2005,29.38421,-98.581082
2,10/10/1955 17:00,chester (uk/england),NaN,gb,circle,20,20 seconds,Green/Orange circular disc over Chester&#44 En...,1/21/2008,53.2,-2.916667
3,10/10/1956 21:00,edna,tx,us,circle,20,1/2 hour,My older brother and twin sister were leaving ...,1/17/2004,28.9783333,-96.645833
4,10/10/1960 20:00,kaneohe,hi,us,light,900,15 minutes,AS a Marine 1st Lt. flying an FJ4B fighter/att...,1/22/2004,21.4180556,-157.803611

In [13]:
df2=df2.drop('state', axis=1)

In [14]:
df2=df2.drop('duration (hours/min)',axis=1)

In [15]:
df2.country.fillna('unknown')

0             us
1        unknown
2             gb
3             us
4             us
          ...
80327         us
80328         us
80329         us
80330         us
80331         us
Name: country, Length: 80332, dtype: object

In [16]:
df2.country.value_counts()

us    65114
ca     3000
gb     1905
au      538
de      105
Name: country, dtype: int64

In [17]:
df2.head()

,datetime,city,country,shape,duration (seconds),comments,date posted,latitude,longitude
0,10/10/1949 20:30,san marcos,us,cylinder,2700,This event took place in early fall around 194...,4/27/2004,29.8830556,-97.941111
1,10/10/1949 21:00,lackland afb,NaN,light,7200,1949 Lackland AFB&#44 TX. Lights racing acros...,12/16/2005,29.38421,-98.581082
2,10/10/1955 17:00,chester (uk/england),gb,circle,20,Green/Orange circular disc over Chester&#44 En...,1/21/2008,53.2,-2.916667
3,10/10/1956 21:00,edna,us,circle,20,My older brother and twin sister were leaving ...,1/17/2004,28.9783333,-96.645833
4,10/10/1960 20:00,kaneohe,us,light,900,AS a Marine 1st Lt. flying an FJ4B fighter/att...,1/22/2004,21.4180556,-157.803611

In [18]:
df2.shape

(80332, 9)

In [19]:
df2=df2.drop('comments',axis=1)

In [20]:
df2=df2.drop('date posted',axis=1)

In [21]:
df2["coordinates"] = df["latitude"].map(str) + "," + df["longitude"].map(str)

In [22]:
df2.head()

,datetime,city,country,shape,duration (seconds),latitude,longitude,coordinates
0,10/10/1949 20:30,san marcos,us,cylinder,2700,29.8830556,-97.941111,"29.8830556,-97.94111109999999"
1,10/10/1949 21:00,lackland afb,NaN,light,7200,29.38421,-98.581082,"29.38421,-98.581082"
2,10/10/1955 17:00,chester (uk/england),gb,circle,20,53.2,-2.916667,"53.2,-2.916667"
3,10/10/1956 21:00,edna,us,circle,20,28.9783333,-96.645833,"28.9783333,-96.64583329999999"
4,10/10/1960 20:00,kaneohe,us,light,900,21.4180556,-157.803611,"21.4180556,-157.8036111"

In [23]:
df2['duration_in_secs']=df2['duration (seconds)']

In [24]:
df2.head()

,datetime,city,country,shape,duration (seconds),latitude,longitude,coordinates,duration_in_secs
0,10/10/1949 20:30,san marcos,us,cylinder,2700,29.8830556,-97.941111,"29.8830556,-97.94111109999999",2700
1,10/10/1949 21:00,lackland afb,NaN,light,7200,29.38421,-98.581082,"29.38421,-98.581082",7200
2,10/10/1955 17:00,chester (uk/england),gb,circle,20,53.2,-2.916667,"53.2,-2.916667",20
3,10/10/1956 21:00,edna,us,circle,20,28.9783333,-96.645833,"28.9783333,-96.64583329999999",20
4,10/10/1960 20:00,kaneohe,us,light,900,21.4180556,-157.803611,"21.4180556,-157.8036111",900

In [65]:
'''from math import radians, cos, sin, asin, sqrt

def haversine(lon1, lat1, lon2, lat2):
    """
    Calcula distancia entre dos puntos en la Tierra
    lon1: float, longitud del primer punto
    lat1: float, latitud del primer punto
    lon2: float, longitud del segundo punto
    lat2: float, latitud del segundo punto
    """
    # convertir grados a radianes 
    lon1, lat1, lon2, lat2 = map(radians, [lon1, lat1, lon2, lat2])

    # formula haversine  
    dlon = lon2 - lon1 
    dlat = lat2 - lat1 
    a = sin(dlat/2)**2 + cos(lat1) * cos(lat2) * sin(dlon/2)**2
    c = 2 * asin(sqrt(a)) 
    r = 6371 # radio Tierra
    return c * r'''

In [25]:
nan_cols = df2.isna().sum()

In [26]:
nan_cols[nan_cols>0]

country    9670
shape      1932
dtype: int64

In [27]:
df2['country']=df2['country'].fillna('unknown')

In [28]:
df2['shape']=df2['shape'].fillna('other')

In [29]:
df2=df2.drop('duration (seconds)',axis=1)

In [30]:
df2.drop(df2[df2['country'] !="us"].index, inplace = True)

In [31]:
df2.head()

,datetime,city,country,shape,latitude,longitude,coordinates,duration_in_secs
0,10/10/1949 20:30,san marcos,us,cylinder,29.8830556,-97.941111,"29.8830556,-97.94111109999999",2700
3,10/10/1956 21:00,edna,us,circle,28.9783333,-96.645833,"28.9783333,-96.64583329999999",20
4,10/10/1960 20:00,kaneohe,us,light,21.4180556,-157.803611,"21.4180556,-157.8036111",900
5,10/10/1961 19:00,bristol,us,sphere,36.5950000,-82.188889,"36.5950000,-82.18888890000001",300
7,10/10/1965 23:45,norwalk,us,disk,41.1175000,-73.408333,"41.1175000,-73.4083333",1200

In [32]:
df3 = df2[['datetime','duration_in_secs','country','city','shape','coordinates']]

In [33]:
df3.head()

,datetime,duration_in_secs,country,city,shape,coordinates
0,10/10/1949 20:30,2700,us,san marcos,cylinder,"29.8830556,-97.94111109999999"
3,10/10/1956 21:00,20,us,edna,circle,"28.9783333,-96.64583329999999"
4,10/10/1960 20:00,900,us,kaneohe,light,"21.4180556,-157.8036111"
5,10/10/1961 19:00,300,us,bristol,sphere,"36.5950000,-82.18888890000001"
7,10/10/1965 23:45,1200,us,norwalk,disk,"41.1175000,-73.4083333"

In [34]:
df2.shape ,df3.shape

((65114, 8), (65114, 6))

In [35]:
df3.city.value_counts()

seattle                                           524
phoenix                                           454
portland                                          373
las vegas                                         367
los angeles                                       352
                                                 ...
mt. kisco                                           1
blackwater                                          1
bedford heights                                     1
tigard (12 mi so of portland&#44 exit 290 i 5)      1
north versailles                                    1
Name: city, Length: 11364, dtype: int64

In [36]:
lst=['seattle','phoenix','portland','las vegas','los angeles']

In [37]:
df3 = df3[df3['city'].isin(lst)]

In [38]:
df3.city.value_counts()

seattle        524
phoenix        454
portland       373
las vegas      367
los angeles    352
Name: city, dtype: int64

In [39]:
df3.head()

,datetime,duration_in_secs,country,city,shape,coordinates
75,10/10/1998 17:30,600,us,las vegas,cigar,"36.1750000,-115.1363889"
76,10/10/1998 17:30,2700,us,las vegas,circle,"36.1750000,-115.1363889"
108,10/10/2001 22:00,60,us,phoenix,triangle,"33.4483333,-112.07333329999999"
113,10/10/2002 06:00,90,us,seattle,sphere,"47.6063889,-122.33083329999998"
116,10/10/2002 21:00,120,us,portland,circle,"45.5236111,-122.675"

In [40]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2070 entries, 75 to 80278
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   datetime          2070 non-null   object
 1   duration_in_secs  2070 non-null   object
 2   country           2070 non-null   object
 3   city              2070 non-null   object
 4   shape             2070 non-null   object
 5   coordinates       2070 non-null   object
dtypes: object(6)
memory usage: 113.2+ KB

In [75]:
! pip install haversine

ERROR: Invalid requirement: '!pip'

In [76]:
!pip install haversine==0.3

Requirement already satisfied: haversine==0.3 in /home/vdiazpliego/anaconda3/lib/python3.8/site-packages (0.3)

In [77]:
from haversine import haversine, Unit

lyon = (45.7597, 4.8422) # (lat, lon)
paris = (48.8567, 2.3508)

haversine(lyon, paris)

392.2172595594006

In [83]:
def distancia(x):
    #area_51 = (37.234332396 , -115.80666344) 
    paris = (48.8567, 2.3508)
  
    return harvesine(x,paris)

def cambio(x):
    n1=float(x.split(',')[0])
    n2=float(x.split(',')[1])
    
    return(n1,n2)

In [79]:
def distancia2(x):
    palo_verde = (33.3916667 , -112.8638889) 
    
    return haversine(x, palo_verde)

In [94]:
def distancia3(x):
    parea_51 = (37.234332396 , -115.80666344)
    
    return haversine(x, parea_51)

In [45]:
df3.coordinates= df3.coordinates.apply(cambio)

In [80]:
df3.head()

,datetime,duration_in_secs,country,city,shape,coordinates
75,10/10/1998 17:30,600,us,las vegas,cigar,"(36.175, -115.1363889)"
76,10/10/1998 17:30,2700,us,las vegas,circle,"(36.175, -115.1363889)"
108,10/10/2001 22:00,60,us,phoenix,triangle,"(33.4483333, -112.07333329999999)"
113,10/10/2002 06:00,90,us,seattle,sphere,"(47.6063889, -122.33083329999998)"
116,10/10/2002 21:00,120,us,portland,circle,"(45.5236111, -122.675)"

In [81]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2070 entries, 75 to 80278
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   datetime          2070 non-null   object
 1   duration_in_secs  2070 non-null   object
 2   country           2070 non-null   object
 3   city              2070 non-null   object
 4   shape             2070 non-null   object
 5   coordinates       2070 non-null   object
dtypes: object(6)
memory usage: 113.2+ KB

In [95]:
df3['distance_in _km_from_a51'] =df3.coordinates.apply(distancia3)

In [96]:
df3['distance_in _km_from_a51'] = df3['distance_in _km_from_a51'].astype(int)

In [97]:
df3['coordinates_area_51']= '37.234332396 , -115.80666344'

In [98]:
df3['coordinates_area_51']= df3['coordinates_area_51'].apply(cambio)

In [99]:
df3['coordinates_palo_verde_nuclear_generating_station']= '33.3916667 , -112.8638889'

In [100]:
df3['coordinates_palo_verde_nuclear_generating_station']=df3['coordinates_palo_verde_nuclear_generating_station'].apply(cambio)

In [101]:
df3['distance_in _km_from_palo_verde_ngs']=df3.coordinates.apply(distancia2)

In [102]:
df3['distance_in _km_from_palo_verde_ngs']=df3['distance_in _km_from_palo_verde_ngs'].astype(int)

Mergeo del dataframe 1= registros USA UFOS(csv limpio) + coordenadas area 51 (webscapping)

In [104]:
df3.head()

,datetime,duration_in_secs,country,city,shape,coordinates,coordinates_area_51,coordinates_palo_verde_nuclear_generating_station,distance_in _km_from_palo_verde_ngs,distance_in _km_from_a51
75,10/10/1998 17:30,600,us,las vegas,cigar,"(36.175, -115.1363889)","(37.234332396, -115.80666344)","(33.3916667, -112.8638889)",372,132
76,10/10/1998 17:30,2700,us,las vegas,circle,"(36.175, -115.1363889)","(37.234332396, -115.80666344)","(33.3916667, -112.8638889)",372,132
108,10/10/2001 22:00,60,us,phoenix,triangle,"(33.4483333, -112.07333329999999)","(37.234332396, -115.80666344)","(33.3916667, -112.8638889)",73,540
113,10/10/2002 06:00,90,us,seattle,sphere,"(47.6063889, -122.33083329999998)","(37.234332396, -115.80666344)","(33.3916667, -112.8638889)",1768,1270
116,10/10/2002 21:00,120,us,portland,circle,"(45.5236111, -122.675)","(37.234332396, -115.80666344)","(33.3916667, -112.8638889)",1587,1084

In [105]:
df3['datetime']=pd.to_datetime(df3['datetime'], errors='coerce')

In [106]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2070 entries, 75 to 80278
Data columns (total 10 columns):
 #   Column                                             Non-Null Count  Dtype
---  ------                                             --------------  -----
 0   datetime                                           2057 non-null   datetime64[ns]
 1   duration_in_secs                                   2070 non-null   object
 2   country                                            2070 non-null   object
 3   city                                               2070 non-null   object
 4   shape                                              2070 non-null   object
 5   coordinates                                        2070 non-null   object
 6   coordinates_area_51                                2070 non-null   object
 7   coordinates_palo_verde_nuclear_generating_station  2070 non-null   object
 8   distance_in _km_from_palo_verde_ngs                2070 non-null   int64
 9   distance_in _km_from_a51                           2070 non-null   int64
dtypes: datetime64[ns](1), int64(2), object(7)
memory usage: 177.9+ KB

In [108]:
df3 = df3.sort_values(by='datetime', ascending = False )

In [109]:
df3.head(15)

,datetime,duration_in_secs,country,city,shape,coordinates,coordinates_area_51,coordinates_palo_verde_nuclear_generating_station,distance_in _km_from_palo_verde_ngs,distance_in _km_from_a51
41797,2014-05-01 21:00:00,2700,us,los angeles,light,"(34.0522222, -118.2427778)","(37.234332396, -115.80666344)","(33.3916667, -112.8638889)",502,416
39963,2014-04-30 21:10:00,60,us,las vegas,light,"(36.175, -115.1363889)","(37.234332396, -115.80666344)","(33.3916667, -112.8638889)",372,132
38936,2014-04-24 20:00:00,240,us,phoenix,circle,"(33.4483333, -112.07333329999999)","(37.234332396, -115.80666344)","(33.3916667, -112.8638889)",73,540
38756,2014-04-23 20:30:00,300,us,phoenix,circle,"(33.4483333, -112.07333329999999)","(37.234332396, -115.80666344)","(33.3916667, -112.8638889)",73,540
38073,2014-04-20 22:50:00,5,us,seattle,formation,"(47.6063889, -122.33083329999998)","(37.234332396, -115.80666344)","(33.3916667, -112.8638889)",1768,1270
38059,2014-04-20 20:00:00,1200,us,seattle,light,"(47.6063889, -122.33083329999998)","(37.234332396, -115.80666344)","(33.3916667, -112.8638889)",1768,1270
38057,2014-04-20 18:20:00,5,us,las vegas,light,"(36.175, -115.1363889)","(37.234332396, -115.80666344)","(33.3916667, -112.8638889)",372,132
38052,2014-04-20 06:10:00,5,us,las vegas,light,"(36.175, -115.1363889)","(37.234332396, -115.80666344)","(33.3916667, -112.8638889)",372,132
37834,2014-04-19 21:00:00,180,us,phoenix,circle,"(33.4483333, -112.07333329999999)","(37.234332396, -115.80666344)","(33.3916667, -112.8638889)",73,540
37674,2014-04-18 23:05:00,240,us,phoenix,oval,"(33.4483333, -112.07333329999999)","(37.234332396, -115.80666344)","(33.3916667, -112.8638889)",73,540
37656,2014-04-18 12:00:00,300,us,portland,light,"(45.5236111, -122.675)","(37.234332396, -115.80666344)","(33.3916667, -112.8638889)",1587,1084
37323,2014-04-16 20:20:00,300,us,las vegas,unknown,"(36.175, -115.1363889)","(37.234332396, -115.80666344)","(33.3916667, -112.8638889)",372,132
37097,2014-04-15 01:00:00,5,us,los angeles,light,"(34.0522222, -118.2427778)","(37.234332396, -115.80666344)","(33.3916667, -112.8638889)",502,416
37096,2014-04-15 00:00:00,60,us,portland,sphere,"(45.5236111, -122.675)","(37.234332396, -115.80666344)","(33.3916667, -112.8638889)",1587,1084
36756,2014-04-14 20:00:00,300,us,las vegas,other,"(36.175, -115.1363889)","(37.234332396, -115.80666344)","(33.3916667, -112.8638889)",372,132

In [110]:
df3.city.value_counts()

seattle        524
phoenix        454
portland       373
las vegas      367
los angeles    352
Name: city, dtype: int64

In [111]:
df3.shape

(2070, 10)

In [112]:
nan_cols= df3.isna().sum()

In [113]:
df3.dropna(subset=['datetime'])

,datetime,duration_in_secs,country,city,shape,coordinates,coordinates_area_51,coordinates_palo_verde_nuclear_generating_station,distance_in _km_from_palo_verde_ngs,distance_in _km_from_a51
41797,2014-05-01 21:00:00,2700,us,los angeles,light,"(34.0522222, -118.2427778)","(37.234332396, -115.80666344)","(33.3916667, -112.8638889)",502,416
39963,2014-04-30 21:10:00,60,us,las vegas,light,"(36.175, -115.1363889)","(37.234332396, -115.80666344)","(33.3916667, -112.8638889)",372,132
38936,2014-04-24 20:00:00,240,us,phoenix,circle,"(33.4483333, -112.07333329999999)","(37.234332396, -115.80666344)","(33.3916667, -112.8638889)",73,540
38756,2014-04-23 20:30:00,300,us,phoenix,circle,"(33.4483333, -112.07333329999999)","(37.234332396, -115.80666344)","(33.3916667, -112.8638889)",73,540
38073,2014-04-20 22:50:00,5,us,seattle,formation,"(47.6063889, -122.33083329999998)","(37.234332396, -115.80666344)","(33.3916667, -112.8638889)",1768,1270
...,...,...,...,...,...,...,...,...,...,...
55117,1954-07-01 22:00:00,15,us,los angeles,circle,"(34.0522222, -118.2427778)","(37.234332396, -115.80666344)","(33.3916667, -112.8638889)",502,416
36776,1953-04-15 12:00:00,5,us,los angeles,fireball,"(34.0522222, -118.2427778)","(37.234332396, -115.80666344)","(33.3916667, -112.8638889)",502,416
26551,1951-02-15 11:00:00,2700,us,los angeles,disk,"(34.0522222, -118.2427778)","(37.234332396, -115.80666344)","(33.3916667, -112.8638889)",502,416
35615,1949-04-10 15:00:00,600,us,seattle,disk,"(47.6063889, -122.33083329999998)","(37.234332396, -115.80666344)","(33.3916667, -112.8638889)",1768,1270
61552,1947-07-04 17:30:00,10,us,seattle,oval,"(47.6063889, -122.33083329999998)","(37.234332396, -115.80666344)","(33.3916667, -112.8638889)",1768,1270

In [114]:
df3.iloc[2054]

datetime                                                       1951-02-15 11:00:00
duration_in_secs                                                              2700
country                                                                         us
city                                                                   los angeles
shape                                                                         disk
coordinates                                             (34.0522222, -118.2427778)
coordinates_area_51                                  (37.234332396, -115.80666344)
coordinates_palo_verde_nuclear_generating_station       (33.3916667, -112.8638889)
distance_in _km_from_palo_verde_ngs                                            502
distance_in _km_from_a51                                                       416
Name: 26551, dtype: object

In [ ]:
df3.shape

In [150]:
df=df3

In [151]:
df

,datetime,duration_in_secs,country,city,shape,coordinates,coordinates_area_51,coordinates_palo_verde_nuclear_generating_station,distance_in _km_from_palo_verde_ngs,distance_in _km_from_a51
41797,2014-05-01 21:00:00,2700,us,los angeles,light,"(34.0522222, -118.2427778)","(37.234332396, -115.80666344)","(33.3916667, -112.8638889)",502,416
39963,2014-04-30 21:10:00,60,us,las vegas,light,"(36.175, -115.1363889)","(37.234332396, -115.80666344)","(33.3916667, -112.8638889)",372,132
38936,2014-04-24 20:00:00,240,us,phoenix,circle,"(33.4483333, -112.07333329999999)","(37.234332396, -115.80666344)","(33.3916667, -112.8638889)",73,540
38756,2014-04-23 20:30:00,300,us,phoenix,circle,"(33.4483333, -112.07333329999999)","(37.234332396, -115.80666344)","(33.3916667, -112.8638889)",73,540
38073,2014-04-20 22:50:00,5,us,seattle,formation,"(47.6063889, -122.33083329999998)","(37.234332396, -115.80666344)","(33.3916667, -112.8638889)",1768,1270
...,...,...,...,...,...,...,...,...,...,...
47553,NaT,60,us,phoenix,oval,"(33.4483333, -112.07333329999999)","(37.234332396, -115.80666344)","(33.3916667, -112.8638889)",73,540
56303,NaT,7200,us,los angeles,circle,"(34.0522222, -118.2427778)","(37.234332396, -115.80666344)","(33.3916667, -112.8638889)",502,416
57326,NaT,300,us,portland,sphere,"(45.5236111, -122.675)","(37.234332396, -115.80666344)","(33.3916667, -112.8638889)",1587,1084
61141,NaT,5400,us,los angeles,circle,"(34.0522222, -118.2427778)","(37.234332396, -115.80666344)","(33.3916667, -112.8638889)",502,416
75647,NaT,360,us,phoenix,other,"(33.4483333, -112.07333329999999)","(37.234332396, -115.80666344)","(33.3916667, -112.8638889)",73,540

In [115]:
from selenium import webdriver

In [116]:
webdriver.Chrome('/mnt/c/Users/Vicente/Desktop/Semana_3/lab_scraping_selenium/your-code/chromedriver.exe')

In [117]:
PATH = '/mnt/c/Users/Vicente/Desktop/Semana_3/lab_scraping_selenium/your-code/chromedriver.exe'

In [118]:
driver=webdriver.Chrome(PATH)
url = 'https://latitude.to/articles-by-country/us/united-states/120/area-51'
driver.get(url)
dd=driver.find_elements_by_id('DD')
dd
coordenadas=[a.get_attribute('value') for a in dd]
coordenadas

['37.234332396 -115.80666344']

In [119]:
pd.DataFrame(coordenadas,columns= ['area_51_coordinates']) #generar un dataframe de un webscrapping

          area_51_coordinates
0  37.234332396 -115.80666344

In [121]:
driver=webdriver.Chrome(PATH)
url = 'https://www.topozone.com/arizona/maricopa-az/locale/palo-verde-nuclear-generating-station/'
driver.get(url)
dd_palo=driver.find_elements_by_id('data')
dd_palo
coordenadas1=[a.text('strong') for a in dd_palo]

TypeError: 'str' object is not callable

Mergeo del dataframe 2( registros USA UFOS(csv limpio) + coordenadas area 51 (webscapping)) + mergeo de los presidentes en EEUU (csv)

In [124]:
df_p=pd.read_csv('us_presidents.csv')  #otro csv para hacer un estudio sobre cuantos avistamientos suceden dependiendo del presidente

In [125]:
df_p=df_p.drop('Unnamed: 0',axis=1)

In [126]:
df_p=df_p.drop('S.No.',axis=1)

In [127]:
df_p=df_p.drop('prior',axis=1)

In [128]:
df_p=df_p.drop('vice',axis=1)

In [129]:
df_p=df_p.drop('party',axis=1)

In [130]:
df_p.end= df_p.end.fillna('January 20, 2017')

In [131]:
df_p['start']=pd.to_datetime(df_p['start'], errors='coerce')

In [132]:
df_p['end']=pd.to_datetime(df_p['end'], errors='coerce')

In [133]:
df_p

        start        end               president
0  1789-04-30 1797-03-04       George Washington
1  1797-03-04 1801-03-04              John Adams
2  1801-03-04 1809-03-04        Thomas Jefferson
3  1809-03-04 1817-03-04           James Madison
4  1817-03-04 1825-03-04            James Monroe
5  1825-03-04 1829-03-04       John Quincy Adams
6  1829-03-04 1837-03-04          Andrew Jackson
7  1837-03-04 1841-03-04        Martin Van Buren
8  1841-03-04 1841-04-04  William Henry Harrison
9  1841-04-04 1845-03-04              John Tyler
10 1845-03-04 1849-03-04           James K. Polk
11 1849-03-04 1850-07-09          Zachary Taylor
12 1850-07-09 1853-03-04        Millard Fillmore
13 1853-03-04 1857-03-04         Franklin Pierce
14 1857-03-04 1861-03-04          James Buchanan
15 1861-03-04 1865-04-15         Abraham Lincoln
16 1865-04-15 1869-03-04          Andrew Johnson
17 1869-03-04 1877-03-04        Ulysses S. Grant
18 1877-03-04 1881-03-04     Rutherford B. Hayes
19 1881-03-04 1881-09-19       James A. Garfield
20 1881-09-19 1885-03-04       Chester A. Arthur
21 1885-03-04 1889-03-04        Grover Cleveland
22 1889-03-04 1893-03-04       Benjamin Harrison
23 1893-03-04 1897-03-04        Grover Cleveland
24 1897-03-04 1901-09-14        William McKinley
25 1901-09-14 1909-03-04      Theodore Roosevelt
26 1909-03-04 1913-03-04     William Howard Taft
27 1913-03-04 1921-03-04          Woodrow Wilson
28 1921-03-04 1923-08-02       Warren G. Harding
29 1923-08-02 1929-03-04         Calvin Coolidge
30 1929-03-04 1933-03-04          Herbert Hoover
31 1933-03-04 1941-01-20   Franklin D. Roosevelt
32 1945-04-12 1953-01-20         Harry S. Truman
33 1953-01-20 1961-01-20    Dwight D. Eisenhower
34 1961-01-20 1963-11-22         John F. Kennedy
35 1963-11-22 1969-01-20       Lyndon B. Johnson
36 1969-01-20 1974-08-09           Richard Nixon
37 1974-08-09 1977-01-20             Gerald Ford
38 1977-01-20 1981-01-20            Jimmy Carter
39 1981-01-20 1989-01-20           Ronald Reagan
40 1989-01-20 1993-01-20       George H. W. Bush
41 1993-01-20 2001-01-20            Bill Clinton
42 2001-01-20 2009-01-20          George W. Bush
43 2009-01-20 2017-01-20            Barack Obama
44 2017-01-20        NaT            Donald Trump

In [158]:
df.to_csv('../Proyecto_ETL/ufo.csv', index=False) #guardar todos los cambios en un csv por si acaso

In [134]:
import mysql.connector as conn

In [135]:
def crear_db(nombre, user='root', password='xx', check=True):
    
    crea_db=conn.connect(host='localhost', user= user, passwd= password)

    cursor=crea_db.cursor()

    cursor.execute(f'drop database if exists {nombre}')
    cursor.execute(f'create database {nombre}')
    
    print('Hecho, base de datos creada. ;)')
    
    if check:
        cursor.execute('show databases')
        for x in cursor:
            print(x)

In [155]:
def crear_tabla_desde_df(df, nombre_tabla, nombre_db, user='root', password='xx', check=True, drop=False):
    
    db=conn.connect(host='localhost', user=user, passwd=password, database=nombre_db)
    cursor=db.cursor()
    
    if drop:
        cursor.execute(f'drop table if exists {nombre_tabla}')
    
    tabla=f"create table {nombre_tabla}(id int, {' varchar(200),'.join(df.columns)} varchar(200));"
    print(tabla)
    
    cursor.execute(tabla)
    
    print(f'Hecho, tabla {nombre_tabla} creada. ;)')
    
    if check:
        cursor.execute('show tables')
        for x in cursor:
            print(x)

In [152]:
def insertar_datos(df, nombre_tabla, nombre_db, user='root', password='xx', check=True):
    
    db=conn.connect(host='localhost', user=user, passwd=password, database=nombre_db)
    cursor=db.cursor()
    
    for i in range(len(df)):
    
        insert_query='insert into {} (id, {}) values {};'\
                     .format(nombre_tabla, ','.join(df.columns), tuple(np.insert(df.iloc[i].values, 0, i)))

        cursor.execute(insert_query)

    db.commit()
    
    print(f'Hecho, datos dentro de tabla {nombre_tabla}. ;)')
    print()
    print(insert_query)

In [153]:
def leer_sql(query, nombre_tabla, nombre_db, user='root', password='xx'):
    
    db=conn.connect(host='localhost', user=user, passwd=password, database=nombre_db)
    
    data=pd.read_sql(query, db)
    
    return data

In [140]:
crear_db('ufos')

Hecho, base de datos creada. ;)
('df3',)
('information_schema',)
('mydb',)
('mysql',)
('performance_schema',)
('proyectosharks',)
('publication',)
('sakila',)
('sharks',)
('sys',)
('ufos',)
('world',)

In [ ]:
insertar_datos(df, 'ufos', 'df3')

In [ ]:
leer_sql('select * from ufos limit 3', 'ufos', 'df3')  # query, tabla, db